toniebox-reverse-engineering/teddycloud/cyclone/cyclone_crypto/hardware/pic32mz/pic32mz_crypto_cipher.c
         //Process each plaintext segment
         while(length > 0)
         {
            //Compute the number of bytes to process at a time
            n = MIN(length, s);

            //Compute O(j) = CIPH(I(j))
            cipher->encryptBlock(context, iv, o);

            //Compute C(j) = P(j) XOR MSB(O(j))
            for(i = 0; i < n; i++)
            {
               c[i] = p[i] ^ o[i];
            }

            //Compute I(j+1) = LSB(I(j)) | O(j)
            osMemmove(iv, iv + s, cipher->blockSize - s);
            osMemcpy(iv + cipher->blockSize - s, o, s);

            //Next block
            p += n;
            c += n;
            length -= n;
         }
      }
      else
      {
         //The value of the parameter is not valid
         error = ERROR_INVALID_PARAMETER;
      }
   }

   //Return status code
   return error;
}

#endif
#if (GCM_SUPPORT == ENABLED && AES_SUPPORT == ENABLED)

/**
 * @brief Perform AES-GCM encryption or decryption
 * @param[in] context AES algorithm context
 * @param[in] iv Initialization vector
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[out] t Authentication tag
 * @param[in] mode Operation mode
 **/

void gcmProcessData(AesContext *context, const uint8_t *iv,
   const uint8_t *a, size_t aLen, const uint8_t *input, uint8_t *output,
   size_t length, uint8_t *t, uint32_t mode)
{
   size_t i;
   size_t n;
   size_t padLen;
   uint32_t *p;

   //Acquire exclusive access to the crypto engine
   osAcquireMutex(&pic32mzCryptoMutex);

   //Reset the crypto engine
   CECON |= _CECON_SWRST_MASK;
   //Wait for the reset to complete
   while((CECON & _CECON_SWRST_MASK) != 0)
   {
   }

   //Clear descriptors
   memset((void *) &cipherBufferDesc, 0, sizeof(Pic32mzCryptoBufferDesc));
   memset((void *) &cipherSecurityAssoc, 0, sizeof(Pic32mzCryptoSecurityAssoc));

   //Set up buffer descriptor
   cipherBufferDesc.SA_ADDR = KVA_TO_PA(&cipherSecurityAssoc);
   cipherBufferDesc.SRCADDR = KVA_TO_PA(cipherInput);
   cipherBufferDesc.DSTADDR = KVA_TO_PA(cipherOutput);
   cipherBufferDesc.NXTPTR = KVA_TO_PA(&cipherBufferDesc);
   cipherBufferDesc.UPDPTR = KVA_TO_PA(gcmAuthTag);

   //Set up security association
   cipherSecurityAssoc.SA_CTRL = SA_CTRL_LNC | SA_CTRL_LOADIV | SA_CTRL_FB |
      SA_CTRL_ALGO_AES | mode;

   //Set encryption key
   aesLoadKey(context);

   //The fourth word of encryption IV for AES GCM shall be 1
   cipherSecurityAssoc.SA_ENCIV[0] = LOAD32BE(iv);
   cipherSecurityAssoc.SA_ENCIV[1] = LOAD32BE(iv + 4);
   cipherSecurityAssoc.SA_ENCIV[2] = LOAD32BE(iv + 8);
   cipherSecurityAssoc.SA_ENCIV[3] = 1;

   //Set the number of cycles that the DMA would wait before refetching the
   //descriptor control word if the previous descriptor fetched was disabled
   CEPOLLCON = 10;

   //Set the address from which the DMA will start fetching buffer descriptors
   CEBDPADDR = KVA_TO_PA(&cipherBufferDesc);

   //Enable DMA engine
   CECON = _CECON_SWAPOEN_MASK | _CECON_SWAPEN_MASK | _CECON_BDPCHST_MASK |
      _CECON_BDPPLEN_MASK | _CECON_DMAEN_MASK;

   //Check parameters
   if(aLen > 0 || length > 0)
   {
      //Select GCM operation mode
      cipherSecurityAssoc.SA_CTRL |= SA_CTRL_CRYPTOALGO_AES_GCM;

      //Specify the length of the payload data and AAD
      cipherBufferDesc.MSG_LEN = length;
      cipherBufferDesc.ENC_OFF = aLen;

      //Process additional authenticated data
      for(i = 0; i < aLen; i += n)
      {
         //Limit the number of data to process at a time
         n = MIN(aLen - i, sizeof(cipherInput));
         //Copy additional authenticated data
         osMemcpy(cipherInput, a, n);

         //Check the length of the incoming data
         if((n % 16) != 0)
         {
            //Padding must be added to ensure the size of the incoming data to
            //be processed is a multiple of 16 bytes
            padLen = 16 - (n % 16);

            //The padding string shall consist of zeroes
            osMemset(cipherInput + n, 0, padLen);
         }
         else
         {
            //No padding needed
            padLen = 0;
         }

         //Set buffer length
         cipherBufferDesc.BD_CTRL = n + padLen;

         //First buffer descriptor?
         if(i == 0)
         {
            //Fetch security association from the SA pointer
            cipherBufferDesc.BD_CTRL |= BD_CTRL_SA_FETCH_EN;
         }

         //Last buffer descriptor?
         if((i + n) == aLen && length == 0)
         {
            //This BD is the last in the frame
            cipherBufferDesc.BD_CTRL |= BD_CTRL_LIFM;
         }

         //Give the ownership of the descriptor to the hardware
         cipherBufferDesc.BD_CTRL |= BD_CTRL_DESC_EN;

         //Wait for the process to complete
         while((cipherBufferDesc.BD_CTRL & BD_CTRL_DESC_EN) != 0)
         {
         }

         //Advance data pointer
         a += n;
      }

      //Process data
      for(i = 0; i < length; i += n)
      {
         //Limit the number of data to process at a time
         n = MIN(length - i, sizeof(cipherInput));
         //Copy input data
         osMemcpy(cipherInput, input, n);

         //Padding must be added to ensure the size of the incoming data to
         //be processed is a multiple of 16 bytes
         cipherBufferDesc.BD_CTRL = (n + 15) & ~15UL;

         //First buffer descriptor?
         if(i == 0 && aLen == 0)
         {
            //Fetch security association from the SA pointer
            cipherBufferDesc.BD_CTRL |= BD_CTRL_SA_FETCH_EN;
         }

         //Last buffer descriptor?
         if((i + n) == length)
         {
            //This BD is the last in the frame
            cipherBufferDesc.BD_CTRL |= BD_CTRL_LIFM;
         }

         //Give the ownership of the descriptor to the hardware
         cipherBufferDesc.BD_CTRL |= BD_CTRL_DESC_EN;

         //Wait for the encryption/decryption to complete
         while((cipherBufferDesc.BD_CTRL & BD_CTRL_DESC_EN) != 0)
         {
         }

         //Copy output data
         osMemcpy(output, cipherOutput, n);

         //Advance data pointer
         input += n;
         output += n;
      }

      //Copy the resulting authentication tag
      osMemcpy(t, gcmAuthTag, 16);
   }
   else
   {
      //Select CTR operation mode
      cipherSecurityAssoc.SA_CTRL |= SA_CTRL_CRYPTOALGO_RCTR | SA_CTRL_ENC;

      //Clear input data block
      osMemset(cipherInput, 0, AES_BLOCK_SIZE);

      //Specify the length of the data block
      cipherBufferDesc.MSG_LEN = AES_BLOCK_SIZE;

      //Give the ownership of the descriptor to the hardware
      cipherBufferDesc.BD_CTRL = BD_CTRL_DESC_EN | BD_CTRL_SA_FETCH_EN |
         BD_CTRL_LIFM | AES_BLOCK_SIZE;

      //Wait for the encryption to complete
      while((cipherBufferDesc.BD_CTRL & BD_CTRL_DESC_EN) != 0)
      {
      }

      //Copy the resulting authentication tag
      osMemcpy(t, cipherOutput, AES_BLOCK_SIZE);
   }

   //Release exclusive access to the crypto engine
   osReleaseMutex(&pic32mzCryptoMutex);
}


/**
 * @brief Initialize GCM context
 * @param[in] context Pointer to the GCM context
 * @param[in] cipherAlgo Cipher algorithm
 * @param[in] cipherContext Pointer to the cipher algorithm context
 * @return Error code
 **/

error_t gcmInit(GcmContext *context, const CipherAlgo *cipherAlgo,
   void *cipherContext)
{
   //The CRYP module only supports AES cipher algorithm
   if(cipherAlgo != AES_CIPHER_ALGO)
      return ERROR_INVALID_PARAMETER;

   //Save cipher algorithm context
   context->cipherAlgo = cipherAlgo;
   context->cipherContext = cipherContext;

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief Authenticated encryption using GCM
 * @param[in] context Pointer to the GCM context
 * @param[in] iv Initialization vector
 * @param[in] ivLen Length of the initialization vector
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] p Plaintext to be encrypted
 * @param[out] c Ciphertext resulting from the encryption
 * @param[in] length Total number of data bytes to be encrypted
 * @param[out] t Authentication tag
 * @param[in] tLen Length of the authentication tag
 * @return Error code
 **/

error_t gcmEncrypt(GcmContext *context, const uint8_t *iv,
   size_t ivLen, const uint8_t *a, size_t aLen, const uint8_t *p,
   uint8_t *c, size_t length, uint8_t *t, size_t tLen)
{
   uint8_t authTag[16];

   //Make sure the GCM context is valid
   if(context == NULL)
      return ERROR_INVALID_PARAMETER;

   //Check whether the length of the IV is 96 bits
   if(ivLen != 12)
      return ERROR_INVALID_LENGTH;

   //Check the length of the authentication tag
   if(tLen < 4 || tLen > 16)
      return ERROR_INVALID_LENGTH;

   //Perform AES-GCM encryption
   gcmProcessData(context->cipherContext, iv, a, aLen, p, c, length,
      authTag, SA_CTRL_ENC);

   //Copy the resulting authentication tag
   osMemcpy(t, authTag, tLen);

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Authenticated decryption using GCM
 * @param[in] context Pointer to the GCM context
 * @param[in] iv Initialization vector
 * @param[in] ivLen Length of the initialization vector
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] c Ciphertext to be decrypted
 * @param[out] p Plaintext resulting from the decryption
 * @param[in] length Total number of data bytes to be decrypted
 * @param[in] t Authentication tag
 * @param[in] tLen Length of the authentication tag
 * @return Error code
 **/

error_t gcmDecrypt(GcmContext *context, const uint8_t *iv,
   size_t ivLen, const uint8_t *a, size_t aLen, const uint8_t *c,
   uint8_t *p, size_t length, const uint8_t *t, size_t tLen)
{
   size_t i;
   uint8_t mask;
   uint8_t authTag[16];

   //Make sure the GCM context is valid
   if(context == NULL)
      return ERROR_INVALID_PARAMETER;

   //Check whether the length of the IV is 96 bits
   if(ivLen != 12)
      return ERROR_INVALID_LENGTH;

   //Check the length of the authentication tag
   if(tLen < 4 || tLen > 16)
      return ERROR_INVALID_LENGTH;

   //Perform AES-GCM decryption
   gcmProcessData(context->cipherContext, iv, a, aLen, c, p, length,
      authTag, 0);

   //The calculated tag is bitwise compared to the received tag
   for(mask = 0, i = 0; i < tLen; i++)
   {
      mask |= authTag[i] ^ t[i];
   }

   //The message is authenticated if and only if the tags match
   return (mask == 0) ? NO_ERROR : ERROR_FAILURE;
}

#endif
#endif
